artillery/config.yaml
config:
  target: "http://localhost:3000"
  processor: ./helper.js
  phases:
    - name: Warm up
      duration: 60
      arrivalRate: 10
    - name: Main
      duration: 900
      arrivalRate: 50
      maxVusers: 200

scenarios:
  - name: "Search flights"
    flow:
      - get:
          url: /destinations
          capture:
            - json: "$"
              as: "destinations"
      - function: setRandomDestination
      - think: 1
      - get:
          url: /flights
          qs:
            from: "{{ flightFrom }}"
      - get:
          url: /flights
          qs:
            to: "{{ flightTo }}"
  - name: "Book flight"
    flow:
      - get:
          url: "/flights"
          capture:
            - json: "$"
              as: "flights"
      - function: setRandomFlightId
      - get:
          url: "/flights/{{ flightId }}/seats"
          capture:
            - json: "$"
              as: "seats"
      - function: setBookingRequest
      - think: 3
      - post:
          url: "/bookings"
          json: "{{ bookingRequest }}"
          auth:
            user: user
            pass: pw